const ur = {
    app: "نوشتہ",
    slogan: "آج کچھ نیا پڑھیں",
    login: {
        title: "داخل ہوں",
        email: {
            title: "ای میل",
            error: "ای میل درست نہیں",
            required: "ای میل ضروری ہے",
        },
        password: {
            title: "پاس ورڈ",
            password: "پاس ورڈ",
            required: "پاس ورڈ ضروری ہے",
        },
        error: "لاگ ان نہیں کر سکے۔ برائے مہربانی یوزر نیم اور پاسورڈ درست کیجیے۔",
    },
    logout: {
        title: "اخراج",
        confirmation: "کیا آپ لاگ آؤٹ کرنا چاہیں گے؟",
    },
    forgotPassword: {
        title: "پاسورڈ بھول گئے ہیں",
        submit: "پاسورڈ حاصل کریں",
        email: {
            title: "ای میل",
            error: "ای میل درست نہیں",
            required: "ای میل ضروری ہے",
        },
        success:
            "پاس ورڈ تبدیل کرنے کے لیے ای میل ارسال کر دی گئی ہے۔ اس کی ہدایات پر عمل کیجیے۔",
        error: "ہدایت کی تکمیل نہیں ہو سکی۔ برائے مہربانی دوبارہ کوشش کیجیے۔",
    },
    register: {
        title: "رکنیت اختیار کریں",
        submit: "رکن بنیں",
        name: {
            label: "نام",
            required: "نام ضروری ہے",
        },
        email: {
            label: "ای میل",
            error: "ای میل درست نہیں",
            required: "ای میل ضروری ہے",
        },
        password: {
            label: "پاس ورڈ",
            required: "پاس ورڈ ضروری ہے",
            length: "پاس ورڈ کم از کم 6 حروف پر مشتمل ہو",
        },
        confirmPassword: {
            label: "تصدیق پاس ورڈ",
            match: "پاس ورڈ ایک جیسے ہوں",
            required: "پاس ورڈ کی تصدیق ضروری ہے",
        },
        success: "رکنیت کامیاب رہی۔ آپاپنے اکاؤنٹ میں داخل ہو سکتے ہیں۔",
        error: "رکنیت ناکام رہی۔ دوبارہ کوشش کریں۔",
        acceptTerms: {
            title: "تمام اصول اور ضوابط تسلیم",
            requires: "تمام اصول اور ضوابط تسلیم کرنا ضروری ہیں۔",
        },
        invitation: {
            expired:
                "دعوت نامہ اب قابلِ قبول نہیں۔ نئی دعوت کے لیے ہم سے رابطہ کیجیے",
            notFound: "دعوت نامہ درست نہیں",
        },
    },
    changePassword: {
        title: "پاس ورڈ کی تبدیلی",
        submit: "پاس ورڑ کی تبدیلی",
        oldPassword: {
            label: "پرانا پاس ورڈ",
            required: "پرانا پاس ورڈ ضروری ہے",
        },
        password: {
            label: "نیا پاس ورڈ",
            required: "نیا پاس ورڈ ضروری ہے",
            length: "پاس ورڈ کم از کم 6 حروف پر مشتمل ہو",
        },
        confirmPassword: {
            label: "تصدیق پاس ورڈ",
            match: "پاس ورڈ ایک جیسے ہوں",
            required: "پاس ورڈ کی تصدیق ضروری ہے",
        },
        success: "پاس ورڈ تبدیل کر دیا گیا ہے۔",
        error: "پاس ورڈ تبدیل کرنے میں ناکامی ہوئی۔",
    },
    resetPassword: {
        title: "پاس ورڈ کی تبدیلی",
        submit: "پاس ورڑ کی تبدیلی",
        password: {
            label: "پاس ورڈ",
            required: "پاس ورڈ ضروری ہے",
            length: "پاس ورڈ کم از کم 6 حروف پر مشتمل ہو",
        },
        confirmPassword: {
            label: "تصدیق پاس ورڈ",
            match: "پاس ورڈ ایک جیسے ہوں",
            required: "پاس ورڈ کی تصدیق ضروری ہے",
        },
        success: "پاس ورڈ تبدیل کر دیا گیا ہے۔",
        error: "پاس ورڈ تبدیل کرنے میں ناکامی ہوئی۔",
        noCode: "کوڈ موجود نہیں۔ برائے مہربانی اپنی ای میل میں موجود ہدایات پر عمل کریں۔",
    },
    403: {
        title: "رسائی میں مسئلہ",
        description: "ہم معذرت خواہ ہیں لیکن آپ یہ صفحہ نہیں دیکھ سکتے۔",
        action: "صفحۂ اوّل",
    },
    404: {
        title: "گمشدہ صفحہ",
        description: "ہم معذرت خواہ ہیں لیکن آپ کا مطلوبہ صفحہ میسر نہیں۔",
        action: "صفحۂ اوّل",
    },
    500: {
        title: "تکنکتی خرابی",
        description: "ہم اس غیر متوقع خرابی کے لیے معذرت خواہ ہیں۔",
        action: "صفحۂ اوّل",
    },
};

export default ur;